<template>
<div>
    <Header/>
    <div class="l-privacy">
        <h2 class="l-privacy__h2">このサイトが収集する個人データと収集の理由</h2>
        <h3 class="l-privacy__h3">コメント</h3>
        <p class="l-privacy__content">訪問者がこのサイトにコメントを残す際、コメントフォームに表示されているデータ、そしてスパム検出に役立てるための IP アドレスとブラウザーユーザーエージェント文字列を収集します。<br>メールアドレスから作成される匿名化された (「ハッシュ」とも呼ばれる) 文字列は、あなたが Gravatar サービスを使用中かどうか確認するため同サービスに提供されることがあります。<br>同サービスのプライバシーポリシーは https://corders-jonio.com/ にあります。<br>コメントが承認されると、プロフィール画像がコメントとともに一般公開されます。</p>
        <h3 class="l-privacy__h3">メディア</h3>
        <p class="l-privacy__content">サイトに画像をアップロードする際、位置情報 (EXIF GPS) を含む画像をアップロードするべきではありません。サイトの訪問者は、サイトから画像をダウンロードして位置データを抽出することができます。</p>
        <h3 class="l-privacy__h3">Cookie</h3>
        <p class="l-privacy__content">サイトにコメントを残す際、お名前、メールアドレス、サイトを Cookie に保存することにオプトインできます。<br>これはあなたの便宜のためであり、他のコメントを残す際に詳細情報を再入力する手間を省きます。この Cookie は1年間保持されます。<br>もしあなたがアカウントを持っており、このサイトにログインすると、私たちはあなたのブラウザーがCookieを受け入れられるかを判断するために一時Cookieを設定します。<br>このCookieは個人データを含んでおらず、ブラウザーを閉じた時に廃棄されます。<br>ログインの際さらに、ログイン情報と画面表示情報を保持するため、私たちはいくつかの Cookie を設定します。<br>ログイン Cookie は2日間、画面表示オプション Cookie は1年間保持されます。<br>「ログイン状態を保存する」を選択した場合、ログイン情報は2週間維持されます。<br>ログアウトするとログイン Cookie は消去されます。<br>もし投稿を編集または公開すると、さらなる Cookie がブラウザーに保存されます。<br>この Cookie は個人データを含まず、単に変更した投稿の ID を示すものです。1日で有効期限が切れます。</p>
        <h3 class="l-privacy__h3">他サイトからの埋め込みコンテンツ</h3>
        <p class="l-privacy__content">このサイトの投稿には埋め込みコンテンツ (動画、画像、投稿など) が含まれます。他サイトからの埋め込みコンテンツは、訪問者がそのサイトを訪れた場合とまったく同じように振る舞います。これらのサイトは、あなたのデータの収集、Cookie の使用、サードパーティによる追加トラッキングの埋め込み、埋め込みコンテンツとのやりとりの監視を行うことがあります。<br>アカウントを使ってそのサイトにログイン中の場合、埋め込みコンテンツとのやりとりのトラッキングも含まれます。</p>
        <h3 class="l-privacy__h3">アナリティクスデータを保存する期間</h3>
        <p class="l-privacy__content">あなたがコメントを残すと、コメントとそのメタデータが無期限に保持されます。<br>これは、モデレーションキューにコメントを保持しておく代わりに、フォローアップのコメントを自動的に認識し承認できるようにするためです。<br>このサイトに登録したユーザーがいる場合、その方がユーザープロフィールページで提供した個人情報を保存します。すべてのユーザーは自分の個人情報を表示、編集、削除することができます (ただしユーザー名は変更することができません)。<br>サイト管理者もそれらの情報を表示、編集できます。</p>
        <h3 class="l-privacy__h3">データに対するあなたの権利</h3>
        <p class="l-privacy__content">このサイトのアカウントを持っているか、サイトにコメントを残したことがある場合、私たちが保持するあなたについての個人データ (提供したすべてのデータを含む) をエクスポートファイルとして受け取るリクエストを行うことができます。<br>また、個人データの消去リクエストを行うこともできます。<br>これには、管理、法律、セキュリティ目的のために保持する義務があるデータは含まれません。</p>
        <h3 class="l-privacy__h3">あなたのデータの送信先</h3>
        <p class="l-privacy__content">訪問者によるコメントは、自動スパム検出サービスを通じて確認を行う場合があります。</p>
        <h3 class="l-privacy__h3">免責事項</h3>
        <p class="l-privacy__content">当サイトからリンクやバナーなどによって他のサイトに移動された場合、移動先サイトで提供される情報、サービス等について一切の責任を負いません。<br>当サイトのコンテンツ・情報につきまして、可能な限り正確な情報を掲載するよう努めておりますが、誤情報が紛れ込んだり、情報が古くなっていることもございます。<br>当サイトに掲載された内容によって生じた損害等の一切の責任を負いかねますのでご了承ください。当サイトからリンクやバナーなどによって他のサイトに移動された場合、移動先サイトで提供される情報、サービス等について一切の責任を負いません。<br>当サイトのコンテンツ・情報につきまして、可能な限り正確な情報を掲載するよう努めておりますが、誤情報が紛れ込んだり、情報が古くなっていることもございます。<br>当サイトに掲載された内容によって生じた損害等の一切の責任を負いかねますのでご了承ください。</p>
        <h3 class="l-privacy__h3">プライバシーポリシーの変更について</h3>
        <p class="l-privacy__content">当サイトは、個人情報に関して適用される日本の法令を遵守するとともに、本ポリシーの内容を適宜見直しその改善に努めます。</p>
    </div>
    <Footer/>
</div>
</template>

<style lang="scss">
    .l-privacy{
        width: 1000px;
        margin:100px auto 0;
        @media screen and (max-width:1023px){
            width: 750px;
            margin-top: 80px;
        }
        @media screen and (max-width:768px){
            width: 90%;
            margin-top: 50px;
        }
        &__h2{
            font-size: 30px;
            line-height:1.5em;
            @media screen and (max-width:1023px){
            font-size: 25px;
        }
        }
        &__h3{
            font-size: 25px;
            margin-top: 30px;
            line-height:1.5em;
            @media screen and (max-width:1023px){
            font-size: 20px;
        }
        }
        &__content{
            margin-top: 20px;
            line-height:2em;
            @media screen and (max-width:1023px){
                font-size: 16px;
            }
            @media screen and (max-width:1023px){
                font-size: 14px;
            }
        }
    }
</style>